{
  "description": [
    "A lo largo de mi carrera como programador, he trabajado en numerosos proyectos personales y profesionales. Creo que es esencial que un programador siempre tenga proyectos personales en los que involucrarse, ya que el conocimiento adquirido en uno puede adaptarse y aplicarse en otro.",
    "Detrás de cada tarjeta, encontrarás información sobre mis roles y los aspectos más relevantes de cada proyecto. También tendrás acceso a enlaces de GitHub para explorar el código, enlaces directos al producto, detalles sobre las tecnologías utilizadas y mi papel en el desarrollo."
  ],
  "projects": [
    {
      "name": "CODERE NEWCO",
      "image": "/images/codere/grupocodere.png",
      "url": "https://www.grupocodere.com",
      "description": "Encargado del desarrollo de las aplicaciones del club de fidelización. Utilizamos una potente arquitectura (ARCA) para encapsular REDUX. La parte core de la arquitectura ha sido integrada por mi. También me he encargado de mantener las dependencias actualizadas e integrar las funcionalidades nativas en plugins para mantener el código limpio y estructurado.",
      "children": [
        {
          "name": "Mi Codere",
          "description": "Mejoramos el rendimiento general utilizando @defer y loaders independientes. La app utiliza una capa de comunicación con Electron, componentes reutilizables e implementación de animaciones utilizando CSS, Ionic Animations y Angular Animations. ",
          "url": "https://play.google.com/store/apps/details?id=codere.club.es&pcampaignid=web_share",
          "image": "/images/codere/es.webp",
          "highlights": [
            { "name": "Hybrid" },
            { "name": "Electron" },
            { "name": "Web" },
            { "name": "Angular" }
          ]
        },
        {
          "name": "Codere LATAM",
          "description": "Las app utilizan una potente arquitectura que unifica el código para diversas apps de todo LATAM, facilitanto el mantenimiento, la escalabilidad y reduciendo los tiempos en el desarrollo. Manejo exitoso de notificaciones push en todas las casuísticas y sistemas.",
          "highlights": [
            { "name": "Hybrid" },
            { "name": "Ionic" },
            { "name": "Push Notifications" }
          ],
          "url": "https://play.google.com/store/apps/details?id=pa.codere.club&pcampaignid=web_share",
          "image": "/images/codere/latam.webp"
        },
        {
          "name": "Push Agent",
          "description": "Software de gestión de notificaciones push. Utiliza un servidor construido desde cero, una base de datos interna (Derby) y un mecanismo que envia notificaciones push sin coste. Utiliza su propio protocolo de comunicación interna, y expone endpoints, websockets e ingesta de ficheros para su integración con sistemas externos.",
          "highlights": [
            { "name": "Java" },
            { "name": "Angular" },
            { "name": "I+D+i" },
            { "name": "Server" }
          ],
          "image": "/images/pushagent/logo.webp"
        },
        {
          "name": "ARCA",
          "description": "ARCA (Automatic REDUX Core Architecture) es una arquitectura técnica que encapsula NgRx. Extraje el software a una librería y reemplacé las dependencias de NgRx por una implementación REDUX propia, mucho más ligera y rápida.",
          "highlights": [
            { "name": "NgRx/RxJs" },
            { "name": "Angular" },
            { "name": "I+D+i" },
            { "name": "Architecture" }
          ],
          "image": "/images/codere/arca.png"
        }
      ]
    },
    {
      "name": "LTA+",
      "description": "Aplicación de cálculo aeroespacial para operaciones militares. Reto técnico que me llevó a liderar el equipo, crear plugins custom, scripts de automatización y seguridad de archivos.",
      "image": "/images/airbus/icon.webp",
      "children": [
        {
          "name": "LTA+",
          "description": "Desarrollé la aplicación desde cero, tomando decisiones importantes en la arquitectura técnica y en la comunicación entre módulos.",
          "highlights": [
            { "name": "Hybrid" },
            { "name": "Angular" },
            { "name": "Ionic" },
            { "name": "I+D+i" },
            { "name": "Architecture" }
          ]
        },
        {
          "name": "E2E Testsuit",
          "description": "Iniciativa propia. Arquitectura de test E2E para aplicaciones iOS. Construye test dinámicamente en base a un fichero excel, permitiendo modificar tests por personal no técnico.",
          "highlights": [
            { "name": "Architecture" },
            { "name": "I+D+i" },
            { "name": "Appium" },
            { "name": "Jasmine" },
            { "name": "WebDriverIO" }
          ]
        },
        {
          "name": "Filesystem Fork",
          "description": "Fork del plugin oficial de Ionic Filesystem que integra soporte para Electron. El proyecto necesita operar contra ficheros en Windows e iOS. No encontramos alternativas, a si que tuvimos que iterar sobre el plugin oficial e incluir funcionalidad adicional.",
          "highlights": [
            { "name": "Capacitor" },
            { "name": "Fork" },
            { "name": "Electron" },
            { "name": "iOS" }
          ]
        },
        {
          "name": "EFB SFTP",
          "description": "Implementación nativa del protocolo SFTP (SSH FIle Transfer Protocol). Integración para Electron e iOS.",
          "highlights": [
            { "name": "Capacitor" },
            { "name": "I+D+i" },
            { "name": "Electron" },
            { "name": "iOS" }
          ]
        },

        {
          "name": "EFB ZIP",
          "description": "Plugin nativo de operaciones de compresión y descompresión de archivos. Permite la gestión de contraseñas. Implementado para Electron e iOS.",
          "highlights": [
            { "name": "Capacitor" },
            { "name": "Electron" },
            { "name": "iOS" }
          ]
        }
      ]
    },
    {
      "name": "Fitness Hub",
      "description": "Aplicación híbrida. Registra tu ingesta de agua, pasos, peso y suplementos. Gratis, sin anuncios y 100% offline. ¡Haz del fitness un hábito fácil y accesible!",
      "url": "/es/fitness-hub",
      "image": "/images/fitness-hub/app-icon.svg",
      "children": [
        {
          "name": "Fitness Hub (APP)",
          "description": "Aplicación híbrida de tracking, fitness y salud. Me encargué de todo el proceso. Desde el diseño hasta la arquitectura, incluyendo la publicación en las stores. Además, diseñé una estrategia para ampliar la base de usuarios, escalar el negocio y monetizar.",
          "highlights": [{ "name": "Angular" }, { "name": "Ionic" }]
        },
        {
          "name": "Pedometer",
          "description": "Plugin custom para interacción con la capa nativa. Se encarga del conteo de pasos (solo compatible con Android).",
          "highlights": [{ "name": "Capacitor" }, { "name": "Java" }]
        }
      ]
    },
    {
      "name": "Portfolio",
      "description": "Mi sitio web personal: un espacio donde muestro todos mis proyectos, maqueto mis currículums y comparto opiniones y experiencias en mi blog.",
      "highlights": ["AstroJS", "Tailwind", "Svelte", "Markdown"],
      "url": "https://gg-victor.dev",
      "github": "https://github.com/N0M4D-D3V/porfolio",
      "image": "/favicon-dark.svg",
      "children": [
        {
          "name": "Porfolio",
          "description": "Codificación, diseño y subida a producción. Genera el contenido dinámicamente basándose en ficheros JSON. Muy flexible para añadir nuevas experiencias, proyectos o artículos al blog.",
          "highlights": [{ "name": "Astro" }, { "name": "Tailwind" }]
        },
        {
          "name": "Blog",
          "description": "Un sitio para escribir sobre mis intereses: tecnología, fitness, ropa, ocio, etc. Utiliza Markdown para construir los post, de modo que el proceso de escribir es fácil y cómodo.",
          "highlights": [{ "name": "Markdown" }, { "name": "Writting" }]
        }
      ]
    },
    {
      "name": "Demiurge",
      "image": "/images/demiurge/logo.webp",
      "description": "La palabra 'demiurge' proviene del griego 'dēmiourgós', que significa 'hacedor', 'artesano', 'productor' y, en última instancia, 'creador'. Demiurge es un conjunto de utilidades para agilizar mis flujos de trabajo y automatizar procesos.",
      "children": [
        {
          "name": "Demiurge",
          "description": "Librería de componentes para agilizar el desarrollo de aplicaciones Angular. Orientado a aplicaciones híbridas.",
          "github": "https://github.com/N0M4D-D3V/demiurge",
          "highlights": [{ "name": "Angular" }, { "name": "Library" }]
        },
        {
          "name": "Youtube2ivooX",
          "isActive": true,
          "description": "Automatización del proceso de descarga y extracción de audio de YouTube. Después sube el audio a iVoox.",
          "highlights": [{ "name": "Python" }, { "name": "Selenium" }],
          "github": "https://github.com/N0M4D-D3V/youtube2ivoox-robot"
        }
      ]
    },
    {
      "name": "Blazebooks",
      "description": "Sumérgete en historias interactivas donde cada elección impacta en la trama y el comportamiento de los personajes.",
      "highlights": ["Aplicación Híbrida"],
      "image": "/images/blazebooks/icon.svg",
      "children": [
        {
          "name": "Blazebooks",
          "description": "Aplicación móvil y web para la lectura de libros interactivos. Incorpora una arquitectura técnica para interpretar historias interactivas de forma abstracta.",
          "highlights": [{ "name": "Hybrid" }],
          "github": "https://github.com/N0M4D-D3V/blazebooks-mobile"
        },
        {
          "name": "Blaze Server",
          "description": "Servidor NodeJS/NestJS que gestiona usuarios, maneja archivos y administra la base de datos. Montado en un PC local dedicado, diferente al del frontal.",
          "highlights": [{ "name": "Node" }, { "name": "Nest" }],
          "github": "https://github.com/N0M4D-D3V/blazebooks-server"
        },
        {
          "name": "Blazebooks (old)",
          "description": "Antigua aplicación. Nativa. Fue mi trabajo final de grado. Obtuve una matrícula de honor.",
          "highlights": [{ "name": "Kotlin" }, { "name": "Java" }],
          "github": "https://github.com/N0M4D-D3V/Blazebooks-old"
        }
      ]
    },
    {
      "name": "Trading Bots",
      "image": "/images/other/p4rz1v4l.webp",
      "description": "Bots de automatización de estrategias de trading.",
      "children": [
        {
          "name": "P4RZ1V4L",
          "description": "Entorno de terminal para hacer backtest de bots de trading. Incorpora algoritmos genéticos y otros sistemas para afinar los parámetros de entrada. Utiliza una arquitectura para la abstracción del backtest.",
          "highlights": [
            { "name": "Python" },
            { "name": "Backtest" },
            { "name": "Architecture" },
            { "name": "I+D+i" },
            { "name": "Genetic Algorithms" }
          ],
          "github": "https://github.com/N0M4D-D3V/p4rz1v4l"
        },
        {
          "name": "L4NC3L0T",
          "description": "Bot de trading automatizado. Es el brazo ejecutor de estrategias de trading. Actúa de manera autónoma utilizando un entorno de terminal.",
          "highlights": [
            { "name": "Python" },
            { "name": "Linux" },
            { "name": "Algorithmic Trading" },
            { "name": "Automation" }
          ],
          "github": "https://github.com/N0M4D-D3V/l4nc3l0t"
        },
        {
          "name": "Trading Bots",
          "description": "Recopilación de bots diseñados para operar con MultiCharts.",
          "highlights": [{ "name": "C#" }],
          "github": "https://github.com/N0M4D-D3V/trad-bots"
        }
      ]
    },
    {
      "name": "Legacy",
      "description": "Recopilación de antiguos proyectos sin relación entre sí. Algunos de ellos fueron muy útiles para crear ciertas piezas de arquitectura y adquirir nuevos conocimientos.",
      "children": [
        {
          "name": "Rainclouds Web",
          "description": "Sitio web para la banda de Atmospheric Black Metal RAZAK. Estuvo en producción durante varios años.",
          "highlights": [
            { "name": "Angular" },
            { "name": "Firebase" },
            { "name": "Bootstrap" }
          ],
          "github": "https://github.com/N0M4D-D3V/rainclouds-webapp",
          "image": "/images/razak/logo.webp"
        },
        {
          "name": "Retro Games",
          "description": "Aplicación de juegos arcade retro. La idea era ofrecer una colección de juegos clásicos optimizados para dispositivos móviles. Para intercomunicar Phaser con Angular, tuve que construir una pieza de arquitectura basada en RXJS. Esta me ha acompañado en todos los de sistemas que he integrado hasta la fecha, debido a su utilidad y versatilidad.",
          "highlights": [
            { "name": "Hybrid" },
            { "name": "Phaser" },
            { "name": "Architecture" }
          ],
          "github": "https://github.com/N0M4D-D3V/arcade-retro-games"
        },
        {
          "name": "Stoic Manager",
          "description": "Aplicación de gestión personal inspirada en los principios estoicos. Busca ayudar a los usuarios a organizar sus tareas diarias.",
          "highlights": [{ "name": "Angular" }, { "name": "Ionic" }],
          "github": "https://github.com/N0M4D-D3V/stoic-manager"
        },
        {
          "name": "Battle of Numbers",
          "description": "Juego para terminal. Desarrollado utilizando Termux desde un teléfono móvil. No tiene dependencias.",
          "highlights": [{ "name": "Python" }, { "name": "Typescript" }],
          "github": "https://github.com/N0M4D-D3V/BattleOfNumbers"
        }
      ]
    }
  ]
}
