{
  "history": {
    "title": "My Story",
    "paragraphs": [
      "In 2020, I started in the tech industry. I have worked for major companies such as Merlin Properties, Airbus Defence And Space, and Codere NEWCO. I have always held positions as a frontend or hybrid application developer. However, I have done a bit of everything: hybrid applications, setting up servers, automation scripts, backends...",
      "I am just a regular person with a regular story. I enjoy computing, music, and fitness. I have always been creative, analytical, and a bit restless.",
      "In 2025, my goal is to publish my own applications and monetize them. In fact, I have a fitness app that is about to launch... What I am sure of is that one day I will be able to make a living from my own software without depending on third-party companies.",
      "Freedom is within reach of any programmer, as many before have proven. You just have to seize it."
    ]
  },
  "skills": {
    "title": "My Skills",
    "description": [
      "My main expertise is software development, focused on web development and hybrid applications. However, I am fully capable of developing any other type of software if necessary: process automation, backend, CMS..."
    ],
    "cards": [
      {
        "title": "Web",
        "icon": "Web",
        "stack": [
          "Angular",
          "Astro",
          "HTML",
          "CSS",
          "Bootstrap",
          "Node",
          "TypeScript",
          "JavaScript"
        ]
      },
      {
        "title": "Hybrid",
        "icon": "Hybrid",
        "stack": [
          "Ionic",
          "Capacitor",
          "XCode",
          "Electron",
          "Native Plugins",
          "Swift",
          "Kotlin",
          "Java"
        ]
      },
      {
        "title": "DevOps & QA",
        "icon": "Multi",
        "stack": [
          "Python",
          "Git",
          "Docker",
          "Linux",
          "Allure",
          "Jasmine",
          "WDIO",
          "Appium"
        ]
      }
    ]
  },
  "contact": {
    "title": "Let's Talk?",
    "options": [
      {
        "text": "LINKEDIN",
        "url": "https://www.linkedin.com/in/victor-develops/",
        "target": "_blank"
      },
      { "text": "RESUME", "url": "/en/cv", "target": "_parent" }
    ]
  }
}
