{
  "history": {
    "title": "Story",
    "paragraphs": [
      "In 2020, I started in the tech industry. Since then, I have worked for large companies such as Merlin Properties, Airbus Defence And Space, and Codere NEWCO. I have always held positions as a multidisciplinary developer/analyst specializing in cross-platform applications. I've done it all: hybrid and web applications, desktop applications, team management, setting up servers, automation scripts, backends...",
      "About me: I like computing, music, and fitness. I've always been creative, analytical, and intellectually curious. If you want to know more about me, I invite you to visit my blog. I'm sure you'll find interesting articles.",
      "In 2025, I will publish my applications and try to monetize them. In fact, I have a fitness app that is about to launch... My current goal is to make a living from software without depending on third-party companies.",
      "Freedom is within reach of any programmer, as many before have demonstrated. You just have to take it."
    ]
  },
  "skills": {
    "title": "Skills",
    "description": [
      "I have been in software development for many years, focusing on web development and, above all, cross-platform applications. I am also fully capable of developing any other type of software: process automation, backend, CMS, desktop applications...",
      "If you want to learn more about my work, I invite you to visit the projects section of this website. There, you will find all the projects I have completed to date, both professional and personal. Many have links so you can check them out."
    ],
    "cards": [
      {
        "title": "web",
        "icon": "Web",
        "stack": [
          "Angular",
          "Astro",
          "HTML",
          "CSS",
          "Bootstrap",
          "Node",
          "TypeScript",
          "JavaScript"
        ]
      },
      {
        "title": "híbrido",
        "icon": "Hybrid",
        "stack": [
          "Ionic",
          "Capacitor",
          "XCode",
          "Android Studio",
          "Electron",
          "Native Plugins",
          "Swift",
          "Java"
        ]
      },
      {
        "title": "DevOps & QA",
        "icon": "Multi",
        "stack": [
          "Python",
          "Git",
          "Docker",
          "Linux",
          "Allure",
          "Jasmine",
          "WDIO",
          "Appium"
        ]
      }
    ]
  },
  "contact": {
    "title": "Let's Talk!",
    "options": [
      {
        "text": "LINKEDIN",
        "url": "https://www.linkedin.com/in/victor-develops/",
        "target": "_blank"
      },
      { "text": "RESUME", "url": "/en/cv", "target": "_parent" }
    ]
  }
}
